### Terraform Plan Results

**Status:** ✅ Success

<details><summary>Show Plan</summary>

```terraform
module.modal_app.null_resource.modal_volume[0]: Refreshing state... [id=5534312244345060584]
null_resource.control_plane_build: Refreshing state... [id=8248606125236277746]
null_resource.slack_bot_build: Refreshing state... [id=5749291029623069111]
module.modal_app.null_resource.modal_secrets[0]: Refreshing state... [id=3991125033446573271]
data.external.modal_source_hash: Reading...
cloudflare_d1_database.main: Refreshing state... [id=5929035a-37d3-40a9-9ba8-6bb20a8f7996]
module.session_index_kv.cloudflare_workers_kv_namespace.this: Refreshing state... [id=20cd831008084e66a21a63410cd5f350]
module.slack_kv.cloudflare_workers_kv_namespace.this: Refreshing state... [id=9f6313d6aaec43c2b677e11e61d894fc]
data.external.modal_source_hash: Read complete after 0s [id=-]
module.modal_app.null_resource.modal_deploy: Refreshing state... [id=1092137256339219601]
module.web_app.vercel_project.this: Refreshing state... [id=prj_rRe2jDS9t2jjyy1xiuWrbw7kXQs6]
null_resource.d1_migrations: Refreshing state... [id=5851108403405785436]
module.control_plane_worker.cloudflare_worker.this: Refreshing state... [id=81781fcfa9b14caca520d9dc7aa706d9]
module.control_plane_worker.cloudflare_worker_version.this: Refreshing state... [id=87a45675-ea7d-442d-97b0-7046f2d5257c]
module.web_app.vercel_project_environment_variable.env[5]: Refreshing state... [id=ObBeQGGf88WSVfUC]
module.web_app.vercel_project_environment_variable.env[3]: Refreshing state... [id=amTaiWNUs9FfMNqQ]
module.web_app.vercel_project_environment_variable.env[1]: Refreshing state... [id=7OkUtGu9PrtXFOPu]
module.web_app.vercel_project_environment_variable.env[7]: Refreshing state... [id=CzYSQUpvdSFybv7v]
module.web_app.vercel_project_environment_variable.env[6]: Refreshing state... [id=CKKq4LYiXGBtkuen]
module.web_app.vercel_project_environment_variable.env[8]: Refreshing state... [id=5YZKecdzdxYIHDtI]
module.web_app.vercel_project_environment_variable.env[0]: Refreshing state... [id=jC2kYsiWrCuuATL9]
module.web_app.vercel_project_environment_variable.env[4]: Refreshing state... [id=TwfVJmoNgOul5Ak8]
module.web_app.vercel_project_environment_variable.env[2]: Refreshing state... [id=kOMITM4LuiBVESGt]
module.control_plane_worker.cloudflare_workers_deployment.this: Refreshing state... [id=3cb56789-edb0-4a81-919d-bc4ef22063a3]
module.slack_bot_worker.cloudflare_worker.this: Refreshing state... [id=2acbaa32b47b4cd5b59ca05022e949e2]
module.slack_bot_worker.cloudflare_worker_version.this: Refreshing state... [id=1883a31e-4fae-41fb-a408-a1a46e3c7c24]
module.slack_bot_worker.cloudflare_workers_deployment.this: Refreshing state... [id=eea5c67b-a8f0-4ab2-bc02-06218b380f68]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # null_resource.control_plane_build must be replaced
-/+ resource "null_resource" "control_plane_build" {
      ~ id       = "8248606125236277746" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2026-02-12T20:50:00Z" -> (known after apply)
        }
    }

  # null_resource.slack_bot_build must be replaced
-/+ resource "null_resource" "slack_bot_build" {
      ~ id       = "5749291029623069111" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2026-02-12T20:50:00Z" -> (known after apply)
        }
    }

  # module.control_plane_worker.cloudflare_worker_version.this must be replaced
-/+ resource "cloudflare_worker_version" "this" {
      ~ annotations         = {
          + workers_message      = (known after apply)
          + workers_tag          = (known after apply)
          ~ workers_triggered_by = "create_version_api" -> (known after apply)
        } -> (known after apply)
      ~ bindings            = (sensitive value) # forces replacement
      ~ created_on          = "2026-02-12T20:50:02Z" -> (known after apply)
      ~ id                  = "87a45675-ea7d-442d-97b0-7046f2d5257c" -> (known after apply)
      + limits              = (known after apply)
      ~ number              = 16 -> (known after apply)
      ~ source              = "terraform" -> (known after apply)
      ~ startup_time_ms     = 0 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.control_plane_worker.cloudflare_workers_deployment.this must be replaced
-/+ resource "cloudflare_workers_deployment" "this" {
      ~ annotations  = {
          + workers_message      = (known after apply)
          ~ workers_triggered_by = "deployment" -> (known after apply)
        } -> (known after apply)
      + author_email = (known after apply)
      ~ created_on   = "2026-02-12T20:50:05Z" -> (known after apply)
      ~ id           = "3cb56789-edb0-4a81-919d-bc4ef22063a3" -> (known after apply)
      ~ source       = "terraform" -> (known after apply)
      ~ versions     = [ # forces replacement
          ~ {
              ~ version_id = "87a45675-ea7d-442d-97b0-7046f2d5257c" -> (known after apply)
                # (1 unchanged attribute hidden)
            },
        ]
        # (3 unchanged attributes hidden)
    }

  # module.modal_app.null_resource.modal_deploy must be replaced
-/+ resource "null_resource" "modal_deploy" {
      ~ id       = "1092137256339219601" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "source_hash"     = "b166b40f2c5e215c2d27f7a618cc0dc712adf0331a7e42f779339b1c274cb995" -> "28ceb65aa7cbe9c427721fd6207b8b1686550011002a03f027107d406de0a6a8"
            # (3 unchanged elements hidden)
        }
    }

  # module.slack_bot_worker.cloudflare_worker_version.this must be replaced
-/+ resource "cloudflare_worker_version" "this" {
      ~ annotations         = {
          + workers_message      = (known after apply)
          + workers_tag          = (known after apply)
          ~ workers_triggered_by = "create_version_api" -> (known after apply)
        } -> (known after apply)
      ~ bindings            = (sensitive value) # forces replacement
      ~ created_on          = "2026-02-12T20:50:07Z" -> (known after apply)
      ~ id                  = "1883a31e-4fae-41fb-a408-a1a46e3c7c24" -> (known after apply)
      + limits              = (known after apply)
      ~ modules             = [
          - { # forces replacement
              - content_file   = "../../..//packages/slack-bot/dist/index.js" -> null
              - content_sha256 = "bab0394093415dacd77def192a1a7048b3278bea8edabfcaea665a92c26469c5" -> null
              - content_type   = "application/javascript+module" -> null
              - name           = "index.js" -> null
            },
          + { # forces replacement
              + content_file   = "../../..//packages/slack-bot/dist/index.js"
              + content_sha256 = "fb92decc5db25a2b253ec083df7c51b8810cf8d9d4eaae99743c43a9f5024004"
              + content_type   = "application/javascript+module"
              + name           = "index.js"
            },
        ]
      ~ number              = 16 -> (known after apply)
      ~ source              = "terraform" -> (known after apply)
      ~ startup_time_ms     = 1 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.slack_bot_worker.cloudflare_workers_deployment.this must be replaced
-/+ resource "cloudflare_workers_deployment" "this" {
      ~ annotations  = {
          + workers_message      = (known after apply)
          ~ workers_triggered_by = "deployment" -> (known after apply)
        } -> (known after apply)
      + author_email = (known after apply)
      ~ created_on   = "2026-02-12T20:50:08Z" -> (known after apply)
      ~ id           = "eea5c67b-a8f0-4ab2-bc02-06218b380f68" -> (known after apply)
      ~ source       = "terraform" -> (known after apply)
      ~ versions     = [ # forces replacement
          ~ {
              ~ version_id = "1883a31e-4fae-41fb-a408-a1a46e3c7c24" -> (known after apply)
                # (1 unchanged attribute hidden)
            },
        ]
        # (3 unchanged attributes hidden)
    }

Plan: 7 to add, 0 to change, 7 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```

</details>

*Pushed by: @DylanZeller*